Improve code quality for the labs
